
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РасчетыКлиент.РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	// Вставить содержимое обработчика.        
	РасчетыКлиент.РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры




&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)    
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;     
	//Практика 6
	//ТекДанные.Цена = РасчетыСервер.ЦенаПродажи(Объект.Дата, ТекДанные.Номенклатура);     
	
	//Практика 8
	ТекДанные.Цена = РасчетыСервер.ЦенаПродажиЗапросом(Объект.Дата, ТекДанные.Номенклатура);
	
	РасчетыКлиент.РассчитатьСумму(ТекДанные);
КонецПроцедуры




&НаСервере
Процедура ПрименитьСкидкуНаСервере()   
	Для каждого СтрокаТЧ из Объект.СписокНоменклатуры Цикл              
		СтрокаТЧ.Цена = СтрокаТЧ.Цена * (1 - ЗначениеСкидки/100);
		СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьСкидку(Команда)
	ПрименитьСкидкуНаСервере();   
	Сообщить("Скидка " + ЗначениеСкидки + "% применена"); 
КонецПроцедуры
