
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;    
	Движения.Продажи.Записывать = Истина;     
	
	
	Движения.ОстаткиМатериалов.Записать();
	Движения.Продажи.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =   
		"ВЫБРАТЬ
		|	ОказаниеУслугСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	ОказаниеУслугСписокНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	СУММА(ОказаниеУслугСписокНоменклатуры.Количество) КАК Количество,
		|	СУММА(ОказаниеУслугСписокНоменклатуры.Сумма) КАК Сумма
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.ОказаниеУслуг.СписокНоменклатуры КАК ОказаниеУслугСписокНоменклатуры
		|ГДЕ
		|	ОказаниеУслугСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугСписокНоменклатуры.Номенклатура,
		|	ОказаниеУслугСписокНоменклатуры.Номенклатура.ВидНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураДокумента.Номенклатура КАК Номенклатура,
		|	НоменклатураДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
		|	НоменклатураДокумента.Количество КАК Количество,
		|	НоменклатураДокумента.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	НоменклатураДокумента КАК НоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиМатериалов.Остатки(
		|				&Дата,
		|				Склад = &Склад
		|					И Материал В
		|						(ВЫБРАТЬ
		|							НоменклатураДокумента.Номенклатура КАК Номенклатура
		|						ИЗ
		|							НоменклатураДокумента КАК НоменклатураДокумента)) КАК ОстаткиМатериаловОстатки
		|		ПО (ОстаткиМатериаловОстатки.Материал = НоменклатураДокумента.Номенклатура)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда     
			
			//Проверка остатков
			Если Выборка.Остаток >= Выборка.Количество Тогда
				
				//регистр ОстаткиМатериалов Расход
				Движение = Движения.ОстаткиМатериалов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Материал = Выборка.Номенклатура;
				Движение.Количество = Выборка.Количество;
				
			Иначе 
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не хватает " + Выборка.Номенклатура 
								+ " в количестве " + Строка(Выборка.Количество - Выборка.Остаток);
				Сообщение.Сообщить();
				
				Отказ = Истина; // Отказ от проведения документа
				Продолжить; 	// переход на след итерацию
				
			КонецЕсли;         
			
		КонецЕсли;       
		
		//регистр Продажи
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.Мастер = Мастер;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = Выборка.Сумма;    
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ИтоговаяСумма = СписокНоменклатуры.Итог("Сумма");         
	Сообщить("Итоговая сумма: " + ИтоговаяСумма );
	
КонецПроцедуры
