
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиМатериалов Расход
	Движения.ОстаткиМатериалов.Записывать = Истина;    
	Движения.Продажи.Записывать = Истина;

	
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл     
		Если ТекСтрокаСписокНоменклатуры.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал тогда
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Материал = ТекСтрокаСписокНоменклатуры.Номенклатура;
			Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;  
		КонецЕсли;

	// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.Мастер = Мастер;
		Движение.Количество = ТекСтрокаСписокНоменклатуры.Количество;
		Движение.Сумма = ТекСтрокаСписокНоменклатуры.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ИтоговаяСумма = СписокНоменклатуры.Итог("Сумма");         
	Сообщить("Итоговая сумма: " + ИтоговаяСумма );
	
КонецПроцедуры
