//Задание1
Процедура ОбрезатьСообщение()
	ИсходнаяСтрока = "Привет, мир!";
	
	Результат = Прав(ИсходнаяСтрока, 4);
	
	Сообщить(Результат);
КонецПроцедуры       

//Задание1_2
Процедура ВывестиИзмененнуюДату()      
	Тек_Дата = ТекущаяДата();
	Сообщить ("Текущая дата: " + Тек_Дата);
	
	Новая_дата = ДобавитьМесяц(Тек_Дата, 1);
	Сообщить("После прибавления месяца: " + Новая_дата);
КонецПроцедуры              

//Задание2
Процедура ОпределитьТипЧисла()       
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Случ_число = ГСЧ.СлучайноеЧисло(0, 20) - 10;
	
	Если Случ_число > 0 Тогда 
		Тип_числа = "Положительное";
	ИначеЕсли Случ_число = 0 Тогда
		Тип_числа = "Ноль";
	Иначе 
		Тип_числа = "Отрицательное";
	КонецЕсли;    
	
	Сообщить("Число: " + Случ_число + ". " + Тип_числа);
Конецпроцедуры           

//Функция для задания 3
Функция СформироватьМассив()
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Массив = Новый Массив;
	
	Для Счетчик = 1 По 15 Цикл
		Число = ГСЧ.СлучайноеЧисло(0,20) - 10;
		
		Массив.Добавить(Число);
	КонецЦикла;   
	
	Возврат Массив;
КонецФункции        
//Вывод для задания 3
Процедура Задание3()  
	Массив_рез = СформироватьМассив();  
	
	СтрокаВывода = СтрСоединить(Массив_рез, "; ");
	Сообщить(СтрокаВывода);
КонецПроцедуры

//Задание 4
Процедура Задание4()          
	МояСтруктура = Новый Структура;
	
	МояСтруктура.Вставить("Это_ключ1", "Первый элемент");
	МояСтруктура.Вставить("Это_ключ2", "Второй элемент");  
	МояСтруктура.Вставить("Это_ключ3", "Третий элемент");      
	
	Для каждого эл из МояСтруктура Цикл      
		Сообщить(эл.Ключ + ": " + эл.Значение);
	КонецЦикла
КонецПроцедуры

//Задание5
Процедура ПроверкаДелимости()  
	n = 19;
	sum = 0;
	i = 0;
	
	Пока i <=n Цикл         
		Если i%5 = 0 тогда
			sum = sum+i; 
		КонецЕсли;
		i = i + 1;
	КонецЦикла;      
	Сообщить("Сумма чисел делющихся на 5 от 0 до " + n + " равна: " + sum);
	
	
КонецПроцедуры






//ОбрезатьСообщение();
//ВывестиИзмененнуюДату();
//ОпределитьТипЧисла();    
//Задание3();   
//Задание4();      
ПроверкаДелимости();


