//Задание1
&НаКлиенте
Процедура СписокМатериаловЦенаПриИзменении(Элемент)
	РасчетыКлиент.РассчитатьСумму(Элементы.СписокМатериалов.ТекущиеДанные);
КонецПроцедуры           

&НаКлиенте
Процедура СписокМатериаловКоличествоПриИзменении(Элемент)
	РасчетыКлиент.РассчитатьСумму(Элементы.СписокМатериалов.ТекущиеДанные);
КонецПроцедуры		  


//Задание2
&НаКлиенте
Процедура СписокМатериаловМатериалПриИзменении(Элемент)   
	ТекДанные = Элементы.СписокМатериалов.ТекущиеДанные;
	ТекДанные.Цена = ЦенаЗакупкиМатериала(ТекДанные.Материал);
	РасчетыКлиент.РассчитатьСумму(Элементы.СписокМатериалов.ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаЗакупкиМатериала(СсылкаНаМатериал)
	Возврат СсылкаНаМатериал.ЦенаЗакупки;
КонецФункции


