

Функция ЦенаПродажи(АктуальнаяДата, ПозицияНоменклатуры) экспорт     
	Отбор = новый структура("Номенклатура", ПозицияНоменклатуры);
	
	ЗначениРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначениРесурсов.Цена;
КонецФункции


Функция ЦенаПродажиЗапросом(АктуальнаяДата, ПозицияНоменклатуры) Экспорт   
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЦеныСрез.Цена КАК Цена
	 |ИЗ
	 |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрез";
	
	Запрос.УстановитьПараметр("Дата", АктуальнаяДата);
	Запрос.УстановитьПараметр("Номенклатура", ПозицияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
	КонецЕсли;
	
КонецФункции
	