
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Константы.Организация,  
	|	ПриходнаяНакладная.Дата,	
	|	ПриходнаяНакладная.Номер,
	|	ПриходнаяНакладная.Склад,
	|	ПриходнаяНакладная.СписокМатериалов.(
	|		НомерСтроки,
	|		Материал,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная,   
	|	Константы КАК Константы	
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокМатериаловШапка = Макет.ПолучитьОбласть("СписокМатериаловШапка");
	ОбластьСписокМатериалов = Макет.ПолучитьОбласть("СписокМатериалов");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(ОбластьЗаголовок);
		
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокМатериаловШапка);
		ВыборкаСписокМатериалов = Выборка.СписокМатериалов.Выбрать();
		Пока ВыборкаСписокМатериалов.Следующий() Цикл
			ОбластьСписокМатериалов.Параметры.Заполнить(ВыборкаСписокМатериалов);
			ТабДок.Вывести(ОбластьСписокМатериалов, ВыборкаСписокМатериалов.Уровень());
		КонецЦикла;

		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
